docs/notes/nlp_workflow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-30 Mon 10:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc885f6c">1. NLP workflow:</a>
<ul>
<li><a href="#orgba6589b">1.1. Sentiment analysis</a>
<ul>
<li><a href="#org61cef1c">1.1.1. Use cases</a></li>
<li><a href="#org96a8e29">1.1.2. Steps of generating sentiment values in GS</a></li>
</ul>
</li>
<li><a href="#org8fb43d9">1.2. Word2vec</a>
<ul>
<li><a href="#org4d33f97">1.2.1. Use cases</a></li>
<li><a href="#org5c6ead2">1.2.2. Steps of finding similar words in GS</a></li>
</ul>
</li>
<li><a href="#org519fbe2">1.3. Information Extraction</a>
<ul>
<li><a href="#orgfaf0dfd">1.3.1. relation extraction</a></li>
<li><a href="#org148bd86">1.3.2. knowledge extraction from scientific publications for ease paper reading</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><b>Author</b></td>
<td class="org-left">Wei Wu (victor.wuv@gmail.com)</td>
</tr>

<tr>
<td class="org-left"><b>Date</b></td>
<td class="org-left">2019-09-30 10:37:28</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-orgc885f6c" class="outline-2">
<h2 id="orgc885f6c"><span class="section-number-2">1</span> NLP workflow:</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://docs.google.com/document/d/1RN49VzAcGFhjHUvXbmYNwyGc0h8ock9jsZ45cv62HUQ/edit?usp=sharing">link</a>
</p>
</div>
<div id="outline-container-orgba6589b" class="outline-3">
<h3 id="orgba6589b"><span class="section-number-3">1.1</span> Sentiment analysis</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A sentiment value determines attitude, which may be a judgment or evaluation, affective state or the intended emotional communication. The sentiment value is labeled as 0 (negative), 1 (neutral) or 2 (positive).
</p>

<p>
GS can read stock news and report from our database, then it analyze the sentiment of the text content, finally giving a sentiment value on each date.
</p>

<p>
We can use this sentiment value as a factor for stocks in the multi-factor analysis.
</p>

<p>
At the same time, we can use this technique to give a sentiment value of the current web page user are browsing.
</p>
<ul class="org-ul">
<li>Input: selected document content</li>
<li>Output: sentiment value time series.</li>
</ul>
</div>

<div id="outline-container-org61cef1c" class="outline-4">
<h4 id="org61cef1c"><span class="section-number-4">1.1.1</span> Use cases</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="org98cdb92"></a>Map stock name related to the news/report statement input into its sentiment value, then we can set them as factors, which can be applied to<br />
<ol class="org-ol">
<li><a id="org28019e2"></a>Factor model - univariate test<br /></li>
<li><a id="orgc1c7e15"></a>Stock selection - pick stocks labeled as 2<br /></li>
</ol>
</li>
<li><a id="org0403a71"></a>Compute average sentiment values in time series, presenting sentiment of overall public opinions, which can be applied to<br />
<div class="outline-text-5" id="text-1-1-1-2">
<p>
Defining and predicting public opinions for investors/analysts who cares (more efficient and probably more accurate than human’s instinct judgement)
</p>

<p>
Eg 短期交易者, dispersion (data and function variance), 与market opinion相对/同做trading
</p>
</div>
</li>
<li><a id="orga8a3ce0"></a>Source is important, diverse and complete enough: possible standard - a database can make completely random sampling<br /></li>
<li><a id="org481a1b1"></a>News sentiment analysis, together with keyword extraction, see below<br /></li>
</ol>
</div>
<div id="outline-container-org96a8e29" class="outline-4">
<h4 id="org96a8e29"><span class="section-number-4">1.1.2</span> Steps of generating sentiment values in GS</h4>
<div class="outline-text-4" id="text-1-1-2">
<ol class="org-ol">
<li>Load report summaries from a relational database, here we use Juyuan MySQL database (see below screenshot).</li>
</ol>
<p>
Hyperparameters:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">input</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">db_name</td>
<td class="org-left">database name</td>
</tr>

<tr>
<td class="org-left">table_name</td>
<td class="org-left">database table</td>
</tr>

<tr>
<td class="org-left">tbl_columns</td>
<td class="org-left">list of column names to select from SQL table (only used when reading a table)</td>
</tr>

<tr>
<td class="org-left">t_filter_col_name</td>
<td class="org-left">column name of date</td>
</tr>

<tr>
<td class="org-left">t_values</td>
<td class="org-left">filter by date</td>
</tr>
</tbody>
</table>

<p>
Output:
An analyst reports dataframe, each report is presented in a row
</p>

<ol class="org-ol">
<li>Apply SnowNLP library’s sentiment method, which is a bayesian classifier.</li>
</ol>
<p>
Then we get each report’s sentiment value.
</p>

<ol class="org-ol">
<li>Calculate the average sentiment value by dividing the total number of reports on each date.</li>
</ol>
<p>
Output is time series.
</p>
</div>
</div>
</div>

<div id="outline-container-org8fb43d9" class="outline-3">
<h3 id="org8fb43d9"><span class="section-number-3">1.2</span> Word2vec</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Word2vec is a group of related models for word embeddings. We provide a specific process of how to use it to find similar words.
</p>

<p>
Input: selected document content
Output: word embedding model
</p>
</div>

<div id="outline-container-org4d33f97" class="outline-4">
<h4 id="org4d33f97"><span class="section-number-4">1.2.1</span> Use cases</h4>
<div class="outline-text-4" id="text-1-2-1">
</div>
<ol class="org-ol">
<li><a id="org57598df"></a>Searching relevant papers: providing similar keywords of papers to the paper title we already have<br />
<div class="outline-text-5" id="text-1-2-1-1">
<p>
‘The Decision Tree Approach to Stock Selection’: find other papers by looking for similar keywords of ‘decision tree classifier’, ‘random forest’, ‘stock prediction’&#x2026;
</p>
</div>
</li>
<li><a id="org764a5fa"></a>Node2vec for GS tasks<br /></li>
<li><a id="org69b8fb5"></a>Policy instance<br /></li>
</ol>
</div>
<div id="outline-container-org5c6ead2" class="outline-4">
<h4 id="org5c6ead2"><span class="section-number-4">1.2.2</span> Steps of finding similar words in GS</h4>
<div class="outline-text-4" id="text-1-2-2">
<ol class="org-ol">
<li>Select corpus, which can be an user interested domain from wikipedia, analyst reports and research files. Assume GS having a category tree of default corpus and there is also an API for users to insert their own sources.</li>

<li>Extract all the related pages by manually selecting a category/keyword, including its subcategories such as depth level. This forms a skill instance.</li>

<li>Output:</li>
</ol>
<p>
A skill instance, which can be shown as a node array as below
</p>

<ol class="org-ol">
<li>Translate the skill instance into graph nodes, then extract all GIDs from the nodes</li>
</ol>
<p>
Function: skill2graph
Graph nodes
</p>

<ul class="org-ul">
<li>Output: node gid</li>

<li>Extract nodes of read only documents</li>
<li>Input: node GID from  above</li>
<li>Function: lib.gftIO.gs_call.get_nodes_binary_data</li>

<li>Text data cleaning</li>
</ul>
<p>
remove punctuation, remove stopwords, tokenize
</p>

<ol class="org-ol">
<li>Train the word2vec model by gensim lib</li>
</ol>
<p>
Hyperparameters
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">input</th>
<th scope="col" class="org-left">description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Window size</td>
<td class="org-left">moving window size.</td>
</tr>

<tr>
<td class="org-left">Dimension</td>
<td class="org-left">word2vec array dimension.</td>
</tr>

<tr>
<td class="org-left">Minimum occurrence</td>
<td class="org-left">minimum occurence of vocabulary.</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Output: trained word2vec model</li>

<li>Cache this model as a policy variable</li>

<li>Find similar words using function ‘model.most_similar()’ from gensim lib</li>
</ul>
<p>
eg. 10 most similar words of ‘股票’.
</p>

<ol class="org-ol">
<li>Evaluation</li>
</ol>
<p>
Currently using human judgement
</p>

<p>
Factor Graph?
</p>

<p>
Other possible methods: <a href="http://www.aclweb.org/anthology/D15-1036">http://www.aclweb.org/anthology/D15-1036</a>
</p>
</div>
</div>
</div>


<div id="outline-container-org519fbe2" class="outline-3">
<h3 id="org519fbe2"><span class="section-number-3">1.3</span> Information Extraction</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgfaf0dfd" class="outline-4">
<h4 id="orgfaf0dfd"><span class="section-number-4">1.3.1</span> relation extraction</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
从文本中抽取两个实体之间的投资关系。
</p>

<p>
下表为投资这一大类关系所包含的相似关系。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">设立</th>
<th scope="col" class="org-left">增资</th>
<th scope="col" class="org-left">入股</th>
<th scope="col" class="org-left">收购</th>
<th scope="col" class="org-left">并购</th>
<th scope="col" class="org-left">换股</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">成立</td>
<td class="org-left">受让</td>
<td class="org-left">现金出资</td>
<td class="org-left">要约收购</td>
<td class="org-left">海外并购</td>
<td class="org-left">转股</td>
</tr>

<tr>
<td class="org-left">发起设立</td>
<td class="org-left">扩股</td>
<td class="org-left">携手</td>
<td class="org-left">拟收购</td>
<td class="org-left">重组</td>
<td class="org-left">交换</td>
</tr>

<tr>
<td class="org-left">组建</td>
<td class="org-left">扩股</td>
<td class="org-left">间接持有</td>
<td class="org-left">并表</td>
<td class="org-left">整合</td>
<td class="org-left">配股</td>
</tr>

<tr>
<td class="org-left">新设</td>
<td class="org-left">占股</td>
<td class="org-left">所持</td>
<td class="org-left">过户</td>
<td class="org-left">兼并</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">出资</td>
<td class="org-left">转让给</td>
<td class="org-left">联手</td>
<td class="org-left">收购了</td>
<td class="org-left">业务整合</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">共同出资</td>
<td class="org-left">认缴</td>
<td class="org-left">正式成为</td>
<td class="org-left">资产收购</td>
<td class="org-left">借壳上市</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">全资</td>
<td class="org-left">定向增发</td>
<td class="org-left">转让给</td>
<td class="org-left">通过收购</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">参股</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">参股</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">入驻</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">创投</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org148bd86" class="outline-4">
<h4 id="org148bd86"><span class="section-number-4">1.3.2</span> knowledge extraction from scientific publications for ease paper reading</h4>
</div>
</div>
</div>
</div>
</body>
</html>
